Merge pull request #77 from krikz/develop
Develop
